{
    "recipes": [
      {
        "id": "lebanese-chicken-wraps",
        "name": "Lebanese Chicken Wraps",
        "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/lebanese-chicken-wraps-9bde695.jpg?quality=90&webp=true&resize=375,341",
        "nutrition": {
          "calories": 466,
          "carbs": 42,
          "protein": 42,
          "fat": 13
        },
        "cookingTime": "Prep: 20 mins, Cook: 10-15 mins, plus marinating",
        "ingredients": [
          "4 Morrisons Chicken Fillets",
          "200g Greek yogurt",
          "juice and zest of 1 lemon",
          "1 tsp allspice",
          "2 tsp olive oil",
          "2 garlic cloves, crushed",
          "25g pine nuts, toasted",
          "small bunch parsley, finely chopped",
          "2 tomatoes, diced",
          "½ cucumber, diced",
          "4 large tortilla wraps or large flatbreads",
          "mixed salad, to serve"
        ],
        "steps": [
          "Lay the Morrisons Chicken Fillets on a sheet of baking parchment, cover with another sheet of parchment, then flatten by bashing them with a rolling pin. Mix half the yogurt in a large bowl with half the lemon juice, the lemon zest, allspice, olive oil, garlic, and a pinch of salt. Mix thoroughly, then stir in the chicken, making sure it is well coated in the mixture. Cover and chill for 30 mins to marinate.",
          "Heat a griddle pan over a high heat and cook the chicken for 5-6 mins each side or until cooked through (you may need to do this in batches). Transfer to a board and slice. Spread the rest of the yogurt over the wraps and fill with the pine nuts, cooked chicken, parsley, tomatoes, and cucumber. Drizzle over the rest of the lemon juice and roll up. Put the wraps back on the griddle pan for 30 secs each side to lightly toast, then serve with a mixed salad."
        ],
        "mealType": "Lunch",
        "tags": ["Healthy", "Chicken", "Middle Eastern"],
        "source": "https://www.bbcgoodfood.com/recipes/lebanese-chicken-wraps"
      },
      {
        "id": "cheese-omelette",
        "name": "Cheese Omelette",
        "image": "https://images.immediate.co.uk/production/volatile/sites/30/2024/01/Cheese-omelette-45155e3.jpg?quality=90&webp=true&resize=375,341",
        "nutrition": {
          "calories": 363,
          "carbs": 0.1,
          "protein": 17,
          "fat": 33
        },
        "cookingTime": "Prep: 5 mins, Cook: 5 mins",
        "ingredients": [
          "2 eggs",
          "½ tbsp olive oil",
          "1 tbsp butter",
          "15g mature cheddar, finely grated"
        ],
        "steps": [
          "Crack the eggs into a jug and whisk well with a fork. Season with a pinch of salt.",
          "Heat the oil and butter in a medium non-stick frying pan over a medium-low heat. Once the butter has started to foam, pour in the eggs and tilt to cover the base of the pan. Using a spatula, gently draw in the eggs from four points so there are folds in the centre. Do this once or twice, then leave the eggs to cook gently for 2-3 mins, until there's a little raw egg still in the middle.",
          "Sprinkle over the cheese and, using your spatula, gently fold the omelette in half. Switch off the heat and let the residual heat from the pan melt the cheese for 1 min. Slide onto your plate and sprinkle over some black pepper to serve."
        ],
        "mealType": "Snack",
        "tags": ["Easy", "Vegetarian", "Gluten-free"],
        "source": "https://www.bbcgoodfood.com/recipes/cheese-omelette"
      },
      {
        "id": "chicken-alfredo",
        "name": "Chicken Alfredo",
        "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/chicken-alfredo-76fc36f.jpg?quality=90&webp=true&resize=375,341",
        "nutrition": {
          "calories": 757,
          "carbs": 60,
          "protein": 29,
          "fat": 43
        },
        "cookingTime": "Prep: 5 mins, Cook: 20 mins",
        "ingredients": [
          "1 tbsp olive oil",
          "4 skinless boneless chicken thighs, cut in half",
          "300g fettuccine, or tagliatelle",
          "1 tbsp butter",
          "200ml double cream",
          "½ a nutmeg, grated",
          "100g parmesan",
          "parsley, chopped, to serve"
        ],
        "steps": [
          "Heat the olive oil in a non-stick frying pan over a medium high heat. Add the chicken thighs and fry for around 10 mins, turning half way, until they are golden brown and cooked through. Set aside to cool a little, then use two forks to shred.",
          "Bring a pan of salted water to the boil and add the pasta, cook for 1 minute less than package instructions. Whilst the pasta is cooking, add the butter to the frying pan over a medium heat, scraping the bottom a little to get any of the browned bits. Tip in the cream along with the nutmeg and bring to a simmer. Add the chicken back to the pan.",
          "Once the pasta is cooked, use tongs to transfer the pasta straight from the water into the frying pan with the cream mixture. Sprinkle most of the parmesan over and use the tongs to toss it all together, adding a splash of the pasta water if it looks a little stiff. Season well, then tip into bowls. Top with the remaining parmesan, a scattering of parsley, and black pepper."
        ],
        "mealType": "Dinner",
        "tags": ["Easy", "Comfort Food", "Pasta"],
        "source": "https://www.bbcgoodfood.com/recipes/chicken-alfredo"
      },
      {
        "id": "chicken-fried-rice",
        "name": "Chicken Fried Rice",
        "image": "https://images.immediate.co.uk/production/volatile/sites/30/2013/08/chicken-fried-rice-1c502f1.jpg?quality=90&webp=true&resize=375,341",
        "nutrition": {
          "calories": 443,
          "fat": 11,
          "saturates": 2,
          "carbs": 60,
          "sugars": 10,
          "fibre": 4,
          "protein": 23,
          "salt": 1.6
        },
        "cookingTime": "Prep: 5 mins, Cook: 10 mins",
        "ingredients": [
          "1 tbsp sunflower oil",
          "3 eggs, beaten with some seasoning",
          "320g pack mixed stir-fry vegetable",
          "1 tbsp mild curry powder",
          "140g frozen sweetcorn",
          "600g cooked rice",
          "1 roasted chicken breast, finely shredded",
          "2 tbsp low-salt soy sauce",
          "2 tbsp sweet chilli sauce",
          "2 tbsp ketchup"
        ],
        "steps": [
          "Heat a splash of oil in a large frying pan and tip in the beaten eggs. Swirl the pan to coat in a thin layer of egg and cook for a few mins until set. Tip onto a chopping board, roll up, slice thinly and set aside.",
          "Heat a little more oil, add the stir-fry veg, curry powder and sweetcorn with a splash of water. Cook for 1-2 mins until the veg starts to wilt, then tip into a bowl. Add the last of the oil to the pan, tip in the rice and chicken, mix well, then add the soy sauce, sweet chilli, ketchup, a splash of water and some black pepper.",
          "Finally, add the eggs and the veg, toss together and heat through until hot. Tip into bowls and serve immediately."
        ],
        "mealType": "Dinner",
        "tags": ["Easy", "Asian", "Leftovers"],
        "source": "https://www.bbcgoodfood.com/recipes/chicken-fried-rice"
      },
      {
        "id": "beef-tacos",
        "name": "Beef Tacos",
        "image": "https://images.immediate.co.uk/production/volatile/sites/30/2021/02/Next-level-tacos-e163429.jpg?quality=90&webp=true&resize=375,341",
        "nutrition": {
          "calories": 792,
          "fat": 44,
          "saturates": 16,
          "carbs": 51,
          "sugars": 8,
          "fibre": 9,
          "protein": 44,
          "salt": 1.7
        },
        "cookingTime": "Prep: 10 mins, Cook: 30 mins",
        "ingredients": [
          "1 tbsp sunflower oil",
          "500g beef mince",
          "300ml beef stock",
          "2 tbsp cumin seeds",
          "1 tbsp coriander seeds",
          "1 tsp black peppercorns",
          "1 tsp chipotle chilli flakes",
          "1 tbsp paprika",
          "1 tbsp dried oregano",
          "1 tsp garlic granules",
          "1 tsp onion granules",
          "2 tsp cornflour",
          "1 large red onion, finely sliced",
          "1 lime, juiced, plus wedges to serve",
          "6-8 small soft wheat or corn tortillas",
          "1 avocado, stoned, peeled and chopped into small chunks",
          "1 tomato, chopped into small chunks",
          "handful of feta, crumbled, or use grated mild cheddar (optional)",
          "2 handfuls of tortilla chips, crushed (optional)"
        ],
        "steps": [
          "First, make the spice mix. Toast the cumin seeds, coriander seeds and peppercorns in a small, dry frying pan, then tip into a spice grinder or use a pestle and mortar to crush to a rough powder. Add the remaining spice mix ingredients, except the cornflour, then grind again. Stir through the cornflour and a pinch of salt. The spice mix will keep in an airtight jar for up to one month.",
          "For the pickled onions, toss the onions with the lime juice and a pinch of salt in a medium glass bowl, then set aside to soften.",
          "Heat the oil in a frying pan over a medium-low heat, and crumble in the mince. Cook for 15-20 mins. At first, it will release some liquid, but once that has bubbled away, the mince will sizzle in its own fat and start to brown and crisp. At this point, stir or toss the mince with a wooden spoon so it browns and caramelises all over. When the mince is well toasted, sprinkle over half the spice mix and continue to cook for 2 mins. Pour over the beef stock and reduce the heat to a simmer. Cook gently for 10 mins until the beef has absorbed most of the stock, and is in a rich, thick gravy. Taste for seasoning.",
          "To assemble the tacos, toast the tortillas in a hot, dry frying pan, or over a flame until lightly blistered. Transfer to a serving plate and spoon the mince into a bowl, then serve the other ingredients in separate bowls, so everyone can assemble their own. Alternatively, spoon the mince into the tortillas, then top with the avocado, tomato, cheese (if using), pickled onions and crushed tortilla chips, if using. Serve the lime wedges on the side for squeezing over."
        ],
        "mealType": "Dinner",
        "tags": ["Spicy", "Beef", "Mexican"],
        "source": "https://www.bbcgoodfood.com/recipes/beef-tacos"
      },
      {
        "id": "chicken-satay-salad",
        "name": "Chicken Satay Salad",
        "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/chicken-satay-salad-8f5b068.jpg?quality=90&webp=true&resize=375,341",
        "nutrition": {
          "calories": 353,
          "fat": 10,
          "saturates": 2,
          "carbs": 24,
          "sugars": 21,
          "fibre": 7,
          "protein": 38,
          "salt": 1.6
        },
        "cookingTime": "Prep: 15 mins, Cook: 5-10 mins, plus at least 1 hr marinating",
        "ingredients": [
          "1 tbsp tamari",
          "1 tsp medium curry powder",
          "¼ tsp ground cumin",
          "1 garlic clove, finely grated",
          "1 tsp clear honey",
          "2 skinless chicken breast fillets (or use turkey breast)",
          "1 tbsp crunchy peanut butter (choose a sugar-free version with no palm oil, if possible)",
          "1 tbsp sweet chilli sauce",
          "1 tbsp lime juice",
          "sunflower oil, for wiping the pan",
          "2 Little Gem lettuce hearts, cut into wedges",
          "¼ cucumber, halved and sliced",
          "1 banana shallot, halved and thinly sliced",
          "coriander, chopped",
          "seeds from ½ pomegranate"
        ],
        "steps": [
          "Pour the tamari into a large dish and stir in the curry powder, cumin, garlic and honey. Mix well. Slice the chicken breasts in half horizontally to make 4 fillets in total, then add to the marinade and mix well to coat. Set aside in the fridge for at least 1 hr, or overnight, to allow the flavours to penetrate the chicken.",
          "Meanwhile, mix the peanut butter with the chilli sauce, lime juice, and 1 tbsp water to make a spoonable sauce. When ready to cook the chicken, wipe a large non-stick frying pan with a little oil. Add the chicken and cook, covered with a lid, for 5-6 mins on a medium heat, turning the fillets over for the last min, until cooked but still moist. Set aside, covered, to rest for a few mins.",
          "While the chicken rests, toss the lettuce wedges with the cucumber, shallot, coriander and pomegranate, and pile onto plates. Spoon over a little sauce. Slice the chicken, pile on top of the salad and spoon over the remaining sauce. Eat while the chicken is still warm."
        ],
        "mealType": "Lunch",
        "tags": ["Healthy", "Chicken", "Salad"],
        "source": "https://www.bbcgoodfood.com/recipes/chicken-satay-salad"
      }
    ]
  }
 
  